# Напишите программу, которая определит позицию второго вхождения строки в списке
# либо сообщит, что её нет.
# Пример:
#
# список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# список: [], ищем: "123", ответ: -1

find = "йцу"
count = 0
list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
i = 0
for i in range(len(list)):
    if list[i] == find:
        count += 1
        if count == 2:
            print(f'Индекс второго вхождения элемента "{find}" = {i}')
            break
if count < 2:
    print(f'Второго вхождения элемента "{find}" нет')

#2 вариант
mass = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
a = "йцу"

try:
    mass.remove(a)
    print(f'Индекс второго вхождения элемента {a} = {(mass.index(a))+1}')
except ValueError:
    print(-1)