# Вывести квадрат числа

n = int(input('Введите число: '))
print(f'Квадрат числа: {n ** 2}')

